### Report for project: `terraform`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.api.aws_route53_record.alias[0] has changed
  ~ resource "aws_route53_record" "alias" {
        id                               = "Z08234653FCYL5Z0JN18X_api.staging.grants.usdigitalresponse.org_A"
        name                             = "api.staging.grants.usdigitalresponse.org"
+       records                          = []
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.api.module.ssl_certificate.aws_acm_certificate.default[0] has changed
  ~ resource "aws_acm_certificate" "default" {
        id                        = "arn:aws:acm:us-west-2:357150818708:certificate/743c2daa-c142-4d56-8451-965989c2e4db"
      ~ renewal_eligibility       = "INELIGIBLE" -> "ELIGIBLE"
        tags                      = {}
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.website.module.cloudfront_ssl_certificate.aws_acm_certificate.default[0] has changed
  ~ resource "aws_acm_certificate" "default" {
        id                        = "arn:aws:acm:us-east-1:357150818708:certificate/28774606-0869-4efb-84bd-40b442eeb3a9"
      ~ renewal_eligibility       = "INELIGIBLE" -> "ELIGIBLE"
        tags                      = {
            "Name"      = "gost-staging"
            "Namespace" = "gost-staging"
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.api.aws_ecs_service.default[0] will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-api"
        name                               = "gost-staging-api"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:2" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_ecs_task_definition.default[0] must be replaced
+/- resource "aws_ecs_task_definition" "default" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:2" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ environment            = [
                      ~ {
                            name  = "API_DOMAIN"
                          ~ value = "https://api.staging.grants.usdigitalresponse.org" -> "https://api.staging.grants.usdr.dev"
                        },
                        {
                            name  = "DATA_DIR"
                            value = "/var/data"
                        },
                        # (3 unchanged elements hidden)
                        {
                            name  = "NODE_OPTIONS"
                            value = "--max_old_space_size=1024"
                        },
                      ~ {
                            name  = "NOTIFICATIONS_EMAIL"
                          ~ value = "notifications@staging.grants.usdigitalresponse.org" -> "notifications@staging.grants.usdr.dev"
                        },
                        {
                            name  = "VUE_APP_GRANTS_API_URL"
                            value = "https://74pah5zi58.execute-api.us-west-2.amazonaws.com"
                        },
                      ~ {
                            name  = "WEBSITE_DOMAIN"
                          ~ value = "https://staging.grants.usdigitalresponse.org" -> "https://staging.grants.usdr.dev"
                        },
                    ]
                    name                   = "api"
                    # (10 unchanged elements hidden)
                } # forces replacement,
                {
                    cpu                    = 0
                    environment            = [
                        {
                            name  = "DD_APM_ENABLED"
                            value = "true"
                        },
                        {
                            name  = "ECS_FARGATE"
                            value = "true"
                        },
                    ]
                    essential              = false
                    image                  = "public.ecr.aws/datadog/agent:latest"
                    mountPoints            = []
                    name                   = "datadog"
                    portMappings           = []
                    readonlyRootFilesystem = false
                    secrets                = [
                        {
                            name      = "DD_API_KEY"
                            valueFrom = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/datadog/api_key"
                        },
                    ]
                    volumesFrom            = []
                },
            ]
        )
      ~ id                       = "gost-staging-api" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
-       tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-08f95063c1cdbe191" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-08f95063c1cdbe191"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.api.aws_iam_role_policy.task["send-emails"] will be updated in-place
  ~ resource "aws_iam_role_policy" "task" {
        id     = "gost-staging-api-ECSTask-2023021701041477300000000a:send-emails"
        name   = "send-emails"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringLike = {
                              ~ "ses:FromAddress" = "notifications@staging.grants.usdigitalresponse.org" -> "notifications@staging.grants.usdr.dev"
                            }
                        }
                      ~ Resource  = "arn:aws:ses:us-west-2:357150818708:identity/staging.grants.usdigitalresponse.org" -> "arn:aws:ses:us-west-2:357150818708:identity/staging.grants.usdr.dev"
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.api.aws_route53_record.alias[0] must be replaced
-/+ resource "aws_route53_record" "alias" {
+       allow_overwrite                  = (known after apply)
      ~ fqdn                             = "api.staging.grants.usdigitalresponse.org" -> (known after apply)
-       health_check_id                  = "" -> null
      ~ id                               = "Z08234653FCYL5Z0JN18X_api.staging.grants.usdigitalresponse.org_A" -> (known after apply)
-       multivalue_answer_routing_policy = false -> null
      ~ name                             = "api.staging.grants.usdigitalresponse.org" -> "api.staging.grants.usdr.dev" # forces replacement
-       records                          = [] -> null
-       set_identifier                   = "" -> null
-       ttl                              = 0 -> null
      ~ zone_id                          = (sensitive value) # forces replacement
        # (1 unchanged attribute hidden)

      ~ alias {
          ~ name                   = "d-d8jzcqy940.execute-api.us-west-2.amazonaws.com" -> (known after apply)
          ~ zone_id                = "Z2OJLYMUO9EFXC" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.website.aws_route53_record.alias[0] must be replaced
-/+ resource "aws_route53_record" "alias" {
+       allow_overwrite                  = (known after apply)
      ~ fqdn                             = "staging.grants.usdigitalresponse.org" -> (known after apply)
-       health_check_id                  = "" -> null
      ~ id                               = "Z08234653FCYL5Z0JN18X_staging.grants.usdigitalresponse.org_A" -> (known after apply)
-       multivalue_answer_routing_policy = false -> null
      ~ name                             = "staging.grants.usdigitalresponse.org" -> "staging.grants.usdr.dev" # forces replacement
-       records                          = [] -> null
-       set_identifier                   = "" -> null
-       ttl                              = 0 -> null
      ~ zone_id                          = (sensitive value) # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.website.aws_s3_object.deploy-config[0] will be updated in-place
  ~ resource "aws_s3_object" "deploy-config" {
      ~ content                = <<-EOT
            window.APP_CONFIG = window.APP_CONFIG || {};
-           window.apiURLForGOST = https://api.staging.grants.usdigitalresponse.org/;
+           window.apiURLForGOST = https://api.staging.grants.usdr.dev/;
        EOT
      ~ etag                   = "e6ce272ca8d4e20b2ab69487b37da2d7" -> "52bb455428b92a0720ca9461d27c4792"
        id                     = "/config/deploy-config.js"
        tags                   = {}
      ~ version_id             = "HwTUY_eMds1TtfTbwVjC5D22coHya7ev" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.api.module.api_gateway.aws_apigatewayv2_api.this[0] will be updated in-place
  ~ resource "aws_apigatewayv2_api" "this" {
        id                           = "74pah5zi58"
        name                         = "gost-staging"
        tags                         = {}
        # (9 unchanged attributes hidden)

      ~ cors_configuration {
          ~ allow_origins     = [
-               "https://api.staging.grants.usdigitalresponse.org",
+               "https://api.staging.grants.usdr.dev",
-               "https://staging.grants.usdigitalresponse.org",
+               "https://staging.grants.usdr.dev",
            ]
            # (5 unchanged attributes hidden)
        }
    }

  # module.api.module.api_gateway.aws_apigatewayv2_api_mapping.this[0] must be replaced
-/+ resource "aws_apigatewayv2_api_mapping" "this" {
      ~ domain_name = "api.staging.grants.usdigitalresponse.org" -> (known after apply) # forces replacement
      ~ id          = "2fe8x5" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.api.module.api_gateway.aws_apigatewayv2_domain_name.this[0] must be replaced
-/+ resource "aws_apigatewayv2_domain_name" "this" {
      ~ api_mapping_selection_expression = "$request.basepath" -> (known after apply)
      ~ arn                              = "arn:aws:apigateway:us-west-2::/domainnames/api.staging.grants.usdigitalresponse.org" -> (known after apply)
      ~ domain_name                      = "api.staging.grants.usdigitalresponse.org" -> "api.staging.grants.usdr.dev" # forces replacement
      ~ id                               = "api.staging.grants.usdigitalresponse.org" -> (known after apply)
-       tags                             = {} -> null
      ~ tags_all                         = {} -> (known after apply)

      ~ domain_name_configuration {
          ~ certificate_arn                        = "arn:aws:acm:us-west-2:357150818708:certificate/743c2daa-c142-4d56-8451-965989c2e4db" -> (known after apply)
          ~ hosted_zone_id                         = "Z2OJLYMUO9EFXC" -> (known after apply)
+           ownership_verification_certificate_arn = (known after apply)
          ~ target_domain_name                     = "d-d8jzcqy940.execute-api.us-west-2.amazonaws.com" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.api.module.grants_scraper.data.aws_iam_policy_document.permissions[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "permissions" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "ecs:RunTask",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowRunTask"

+           condition {
+               test     = "ArnLike"
+               values   = [
+                   "arn:aws:ecs:us-west-2:357150818708:cluster/gost-staging",
                ]
+               variable = "ecs:cluster"
            }
        }
+       statement {
+           actions   = [
+               "iam:PassRole",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:iam::357150818708:role/gost-staging-api-ECSTask-2023021701041477300000000a",
+               "arn:aws:iam::357150818708:role/gost-staging-api-ECSTaskExecution-20230217010414321500000009",
            ]
+           sid       = "AllowSchedulerPassRoleToExecutionRole"
        }
    }

  # module.api.module.grants_scraper.aws_iam_role_policy.default[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "default" {
        id     = "gost-staging-grants_scraper-2023021701041523320000000b:terraform-20230217010528091000000012"
        name   = "terraform-20230217010528091000000012"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "ecs:RunTask"
-                       Condition = {
-                           ArnLike = {
-                               "ecs:cluster" = "arn:aws:ecs:us-west-2:357150818708:cluster/gost-staging"
                            }
                        }
-                       Effect    = "Allow"
-                       Resource  = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:*"
-                       Sid       = "AllowRunTask"
                    },
-                   {
-                       Action   = "iam:PassRole"
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:iam::357150818708:role/gost-staging-api-ECSTaskExecution-20230217010414321500000009",
-                           "arn:aws:iam::357150818708:role/gost-staging-api-ECSTask-2023021701041477300000000a",
                        ]
-                       Sid      = "AllowSchedulerPassRoleToExecutionRole"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.api.module.grants_scraper.aws_scheduler_schedule.default[0] will be updated in-place
  ~ resource "aws_scheduler_schedule" "default" {
        id                           = "default/gost-staging-grants_scraper-20230217010528095600000013"
        name                         = "gost-staging-grants_scraper-20230217010528095600000013"
        # (10 unchanged attributes hidden)

      ~ target {
            # (3 unchanged attributes hidden)

          ~ ecs_parameters {
                tags                    = {}
              ~ task_definition_arn     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:2" -> (known after apply)
                # (8 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.api.module.ssl_certificate.aws_acm_certificate.default[0] must be replaced
+/- resource "aws_acm_certificate" "default" {
      ~ arn                       = "arn:aws:acm:us-west-2:357150818708:certificate/743c2daa-c142-4d56-8451-965989c2e4db" -> (known after apply)
      ~ domain_name               = "api.staging.grants.usdigitalresponse.org" -> "api.staging.grants.usdr.dev" # forces replacement
      ~ domain_validation_options = [
-           {
-               domain_name           = "api.staging.grants.usdigitalresponse.org"
-               resource_record_name  = "_f45d47d290ce6d1dec6482fe5317187a.api.staging.grants.usdigitalresponse.org."
-               resource_record_type  = "CNAME"
-               resource_record_value = "_5a3739a580c06f26c0266413fcf661fc.htgdxnmnnj.acm-validations.aws."
            },
            # (1 unchanged element hidden)
        ]
      ~ id                        = "arn:aws:acm:us-west-2:357150818708:certificate/743c2daa-c142-4d56-8451-965989c2e4db" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2024-03-22T23:59:59Z" -> (known after apply)
      ~ not_before                = "2023-02-22T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
-           "api.staging.grants.usdigitalresponse.org",
+           "api.staging.grants.usdr.dev",
        ]
-       tags                      = {} -> null
      ~ tags_all                  = {} -> (known after apply)
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.api.module.ssl_certificate.aws_acm_certificate_validation.default[0] must be replaced
-/+ resource "aws_acm_certificate_validation" "default" {
      ~ certificate_arn         = "arn:aws:acm:us-west-2:357150818708:certificate/743c2daa-c142-4d56-8451-965989c2e4db" -> (known after apply) # forces replacement
      ~ id                      = "0001-01-01 00:00:00 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
-           "_f45d47d290ce6d1dec6482fe5317187a.api.staging.grants.usdigitalresponse.org",
        ] -> (known after apply) # forces replacement
    }

  # module.api.module.ssl_certificate.aws_route53_record.default["api.staging.grants.usdigitalresponse.org"] will be destroyed
  # (because key ["api.staging.grants.usdigitalresponse.org"] is not in for_each map)
-   resource "aws_route53_record" "default" {
-       allow_overwrite                  = true -> null
-       fqdn                             = "_f45d47d290ce6d1dec6482fe5317187a.api.staging.grants.usdigitalresponse.org" -> null
-       id                               = "Z08234653FCYL5Z0JN18X__f45d47d290ce6d1dec6482fe5317187a.api.staging.grants.usdigitalresponse.org._CNAME" -> null
-       multivalue_answer_routing_policy = false -> null
-       name                             = "_f45d47d290ce6d1dec6482fe5317187a.api.staging.grants.usdigitalresponse.org" -> null
-       records                          = [
-           "_5a3739a580c06f26c0266413fcf661fc.htgdxnmnnj.acm-validations.aws.",
        ] -> null
-       ttl                              = 300 -> null
-       type                             = "CNAME" -> null
-       zone_id                          = "Z08234653FCYL5Z0JN18X" -> null
    }

  # module.api.module.ssl_certificate.aws_route53_record.default["api.staging.grants.usdr.dev"] will be created
+   resource "aws_route53_record" "default" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 300
+       type            = (known after apply)
+       zone_id         = "Z05624151CBH3KFEWL6DW"
    }

  # module.website.module.cdn.aws_cloudfront_distribution.this[0] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
      ~ aliases                        = [
-           "staging.grants.usdigitalresponse.org",
+           "staging.grants.usdr.dev",
        ]
        id                             = "E1JJ5NAYUQCPD6"
        tags                           = {}
        # (19 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:357150818708:certificate/28774606-0869-4efb-84bd-40b442eeb3a9" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.website.module.cloudfront_ssl_certificate.aws_acm_certificate.default[0] must be replaced
+/- resource "aws_acm_certificate" "default" {
      ~ arn                       = "arn:aws:acm:us-east-1:357150818708:certificate/28774606-0869-4efb-84bd-40b442eeb3a9" -> (known after apply)
      ~ domain_name               = "staging.grants.usdigitalresponse.org" -> "staging.grants.usdr.dev" # forces replacement
      ~ domain_validation_options = [
-           {
-               domain_name           = "staging.grants.usdigitalresponse.org"
-               resource_record_name  = "_8a4b794e89e2c46acda16b8188d96159.staging.grants.usdigitalresponse.org."
-               resource_record_type  = "CNAME"
-               resource_record_value = "_162e2600eb5a951bf45fad16a98c71aa.htgdxnmnnj.acm-validations.aws."
            },
            # (1 unchanged element hidden)
        ]
      ~ id                        = "arn:aws:acm:us-east-1:357150818708:certificate/28774606-0869-4efb-84bd-40b442eeb3a9" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2024-03-22T23:59:59Z" -> (known after apply)
      ~ not_before                = "2023-02-22T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
-           "staging.grants.usdigitalresponse.org",
+           "staging.grants.usdr.dev",
        ]
        tags                      = {
            "Name"      = "gost-staging"
            "Namespace" = "gost-staging"
        }
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.website.module.cloudfront_ssl_certificate.aws_acm_certificate_validation.default[0] must be replaced
+/- resource "aws_acm_certificate_validation" "default" {
      ~ certificate_arn         = "arn:aws:acm:us-east-1:357150818708:certificate/28774606-0869-4efb-84bd-40b442eeb3a9" -> (known after apply) # forces replacement
      ~ id                      = "0001-01-01 00:00:00 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
-           "_8a4b794e89e2c46acda16b8188d96159.staging.grants.usdigitalresponse.org",
        ] -> (known after apply) # forces replacement
    }

  # module.website.module.cloudfront_ssl_certificate.aws_route53_record.default["staging.grants.usdigitalresponse.org"] will be destroyed
  # (because key ["staging.grants.usdigitalresponse.org"] is not in for_each map)
-   resource "aws_route53_record" "default" {
-       allow_overwrite                  = true -> null
-       fqdn                             = "_8a4b794e89e2c46acda16b8188d96159.staging.grants.usdigitalresponse.org" -> null
-       id                               = "Z08234653FCYL5Z0JN18X__8a4b794e89e2c46acda16b8188d96159.staging.grants.usdigitalresponse.org._CNAME" -> null
-       multivalue_answer_routing_policy = false -> null
-       name                             = "_8a4b794e89e2c46acda16b8188d96159.staging.grants.usdigitalresponse.org" -> null
-       records                          = [
-           "_162e2600eb5a951bf45fad16a98c71aa.htgdxnmnnj.acm-validations.aws.",
        ] -> null
-       ttl                              = 300 -> null
-       type                             = "CNAME" -> null
-       zone_id                          = "Z08234653FCYL5Z0JN18X" -> null
    }

  # module.website.module.cloudfront_ssl_certificate.aws_route53_record.default["staging.grants.usdr.dev"] will be created
+   resource "aws_route53_record" "default" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 300
+       type            = (known after apply)
+       zone_id         = "Z05624151CBH3KFEWL6DW"
    }

Plan: 11 to add, 7 to change, 11 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: `Terraform CI`*